In [1]:
import requests
import pandas as pd
from bs4 import BeautifulSoup

In [3]:
url = "https://webpages.charlotte.edu/mscipion/"

r= requests.get(url)

In [5]:
soup = BeautifulSoup(r.text, 'html.parser')
table = soup.find('table')
print(table)

<table>
<tr>
<th>Student</th>
<th>Favourite Computer Language</th>
<th>Years of Experience</th>
</tr>
<tr>
<td>Fred</td>
<td>Kotlin</td>
<td>4</td>
</tr>
<tr>
<td>Paula</td>
<td>Python</td>
<td>2</td>
</tr>
<tr>
<td>Ernst</td>
<td>Java</td>
<td>7</td>
</tr>
<tr>
<td>Isabel</td>
<td>C++</td>
<td>3</td>
</tr>
<tr>
<td>Tony</td>
<td>Pearl</td>
<td>7</td>
</tr>
<tr>
<td>Maria</td>
<td>Cobol</td>
<td>15</td>
</tr></table>

In [6]:
headers = table.find_all("th")
print(headers)

[<th>Student</th>, <th>Favourite Computer Language</th>, <th>Years of Experience</th>]

In [7]:
titles = []

for i in headers:
    title = i.text
    titles.append(title)
    
print(titles)

['Student', 'Favourite Computer Language', 'Years of Experience']

In [11]:
df1= pd.DataFrame(columns=titles)
df1.describe()

       Student Favourite Computer Language Years of Experience
count        0                           0                   0
unique       0                           0                   0
top        NaN                         NaN                 NaN
freq       NaN                         NaN                 NaN

In [13]:
rows = table.find_all("tr")

In [17]:
for i in rows[1:]:
    data = i.find_all("td")
    row = [tr.text for tr in data]
    l=len(df1)
    df1.loc[l] = row

df1

   Student Favourite Computer Language Years of Experience
0     Fred                      Kotlin                   4
1    Paula                      Python                   2
2    Ernst                        Java                   7
3   Isabel                         C++                   3
4     Tony                       Pearl                   7
5    Maria                       Cobol                  15
6     Fred                      Kotlin                   4
7    Paula                      Python                   2
8    Ernst                        Java                   7
9   Isabel                         C++                   3
10    Tony                       Pearl                   7
11   Maria                       Cobol                  15